/*
Localizations.strings
NovaFoundation

Created by Logan Collins on 6/22/16.
Copyright © 2016 Panic Inc. All rights reserved.
*/


// General
"None" = "None";


// Clips
"Editor" = "Editor";
"Terminal" = "Terminal";
"Plain Text" = "纯文本";

"SELECTED_TEXT" = "Text Selection";
"DATE" = "Date";
"FILENAME" = "Filename";
"FILE_PATH" = "File Path";
"PARENT_FOLDER" = "Parent Folder";
"WORKSPACE_NAME" = "Project Name";
"AUTHOR_NAME" = "Author Name";
"SCM_REVISION" = "SCM Revision";
"PREVIOUS_TEXT" = "Previous Text";
"PASTEBOARD_TEXT" = "Pasteboard Text";


// Keyboard
"Space" = "Space";
"Insert" = "Insert";
"Clear" = "Clear";
"Help" = "Help";


// Extensions
"The extension “%@” was not found." = "The extension “%@” was not found.";
"The extension “%@” experienced an error." = "The extension “%@” experienced an error.";
"The extension “%@” could not be loaded because it requires %@ %@ or later." = "The extension “%@” could not be loaded because it requires %@ %@ or later.";

"No command found with the name “%@”." = "No command found with the name “%@”.";
"Check to make sure the extension for the command is installed and up to date." = "Check to make sure the extension for the command is installed and up to date.";

"No assistant found with the name “%@”." = "No assistant found with the name “%@”.";
"Check to make sure the extension for the assistant is installed and up to date." = "Check to make sure the extension for the assistant is installed and up to date.";

"The extension “%@” is already installed." = "The extension “%@” is already installed.";
"If you would like to modify the provided extension, copy it outside of the extensions container directory and open it as a workspace." = "If you would like to modify the provided extension, copy it outside of the extensions container directory and open it as a workspace.";

"An extension with the identifier “%@” is already installed." = "An extension with the identifier “%@” is already installed.";
"The version being installed is either older or not compatible. Remove the existing extension before attempting to install another." = "The version being installed is either older or not compatible. Remove the existing extension before attempting to install another.";

"Could not locate the extension in the unarchived package." = "Could not locate the extension in the unarchived package.";
"The extension download server returned an unexpected status code (%d)." = "The extension download server returned an unexpected status code (%d).";
"An error was returned from the Extension Library." = "An error was returned from the Extension Library.";

"Authentication failed." = "验证失败。";

"ExtensionCategoryName_clips" = "剪辑";
"ExtensionCategoryName_commands" = "命令";
"ExtensionCategoryName_completions" = "完成";
"ExtensionCategoryName_debuggers" = "调试器";
"ExtensionCategoryName_formatters" = "格式器";
"ExtensionCategoryName_issues" = "验证器";
"ExtensionCategoryName_key-bindings" = "按键绑定";
"ExtensionCategoryName_languages" = "语言";
"ExtensionCategoryName_tasks" = "任务";
"ExtensionCategoryName_sidebars" = "边栏";
"ExtensionCategoryName_themes" = "主题";


// Extension Validation
"No extension logo image found." = "未找到扩展徽标图像。";
"A primary image is required named \"extension.png\" at the root of the extension bundle." = "在扩展包的根目录中需要一个名为“extension.png”的主图像。";

"Extension primary image too large." = "扩展主图像太大。";
"The extension's primary image should not be larger than 512px." = "扩展的主图像不应大于 512px。";

"No extension name specified." = "未指定扩展名称。";
"A user-readable name must be specified for the extension." = "必须为扩展指定用户可读的名称。";

"No extension description specified." = "未指定扩展描述。";
"Providing a description helps to illustrate the usefulness of your extension to users." = "提供描述有助于说明扩展对用户的有用性。";

"Invalid version number specified." = "指定的版本号无效。";
"Version numbers for extensions should follow a scheme such as \"xx.yy.zz\"." = "扩展版本号应遵循语义化版本控制方案，例如\"xx.yy.zz\"。";

"Version number is the same or older." = "版本号相同或更老。";
"The updated extension version number is the same or older than the currently published version. Bump your extension's version number to submit an update." = "更新的扩展版本号与当前发布的版本相同或较早。增加扩展的版本号以提交更新。";

"No organization specified." = "未指定供应商名称。";
"A user-readable organization name must be specified for the extension." = "必须为扩展指定用户可读的供应商名称。";

"The \"author\" metadata key is no longer supported." = "\"author\"元数据键已弃用。";
"Use of the \"author\" key should be replaced with the \"organization\" key instead." = "使用\"author\"键应改为使用\"organization\"键。";

"The \"vendor\" metadata key is no longer supported." = "\"vendor\"元数据键已弃用。";
"Use of the \"vendor\" key should be replaced with the \"organization\" key instead." = "使用\"vendor\"键应改为使用\"organization\"键。";

"No extension activation events specified." = "未指定扩展激活事件。";
"One or more activation events must be specified for extensions that include scripts." = "必须为包含脚本的扩展指定一个或多个激活事件。";

"No extension categories specified." = "未指定扩展类别。";
"Specifying categories helps users to find your extension in the library." = "指定类别可以帮助用户在库中找到您的扩展。";

"Invalid extension category: \"%@\"." = "无效的扩展类别：\"%@\"。";
"Ensure that the category identifiers you have specified exactly match those available in the documentation." = "确保指定的类别标识符与文稿中可用的类别标识符完全匹配。";

"Missing components for category: \"%@\"." = "类别缺少部件：\"%@\"。";
"Extensions using the Clips category must include at least one set of clips for the Clips sidebar." = "使用剪辑类别的扩展必须至少包含一组剪辑边栏剪辑。";
"Extensions using the Commands category must include at least one command" = "使用命令类别的扩展必须至少包含一个命令";
"Extensions using the Key Bindings category must include at least one key binding set." = "使用按键绑定类别的扩展必须至少包含一个按键绑定集。";
"Extensions using the Sidebars category must include at least one sidebar definition." = "使用边栏类别的扩展必须至少包含一个边栏定义。";
"Extensions using the Tasks category must include at least one task configuration template definition." = "使用任务类别的扩展必须至少包含一个任务配置模板定义。";
"Extensions using the Themes category must include at least one theme." = "使用主题类别的扩展必须至少包含一个主题。";

"A main script was specified but not found." = "指定了主脚本，但未找到。";
"The extension specifies a main script named “%@”, but the file could not be read. Check to ensure this file exists within the extension's \"Scripts/\" folder." = "扩展指定了一个名为“%@”的主要脚本，但文件无法被读取。请检查以确保此文件在扩展的\"Scripts/\"文件夹中。";

"No bug reporting link specified." = "未指定错误报告链接。";
"Specifying a bug reporting link helps users to submit issues related to your extension. Specify a URL and / or email address using the \"bugs\" key in your extension's manifest." = "指定一个错误报告链接，帮助用户提交与您的扩展有关的问题。使用\"bugs\"键在您的扩展清单中指定一个 URL 及/或电邮地址。";

"No Readme found." = "未找到 Readme 文件。";
"A README.md file is required. Place this file in the root of the extension." = "需要一个 README.md 文件。将此文件放在扩展名的根目录中。";

"No Change Log found." = "未找到更改日志。";
"A CHANGELOG.md file is required. Place this file in the root of the extension." = "需要一个 CHANGELOG.md 文件。将此文件放在扩展名的根目录中。";

"Missing architectures in grammar library." = "语法库中缺少架构。";
"The grammar \"%@\" is missing one or more required architectures: (%@)." = "“%@” 语法缺少一个或多个必要的架构：(%@)。";

"Invalid code signature for grammar library." = "语法库的代码签名无效。";
"The grammar \"%@\" does not have a valid code signature: %@." = "“%@” 语法没有有效的代码签名：%@。";
